using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class TutorialScript
{
    public static readonly string[] scripts = 
    {
        "안녕! 나는 두돼지야 Miner에 온걸 환영해!"
        + "\n\n여기서는 미로를 직접 만들고 공유할 수 있어!"
        + "\n\n그럼 지금부터 어떻게 미로를 만들고"
        + "\n공유할 수 있을지 설명해줄게!",

        "먼저, 설명이 끝나면 나올 화면에서"
        + "\n'설계' 표지판을 눌러서 미로 설계 화면으로 들어가"
        + "\n\n이 곡괭이 버튼을 누르고 잔디밭을 터치하면"
        + "\n두돼지가 지나다닐 수 있는 길이 만들어져!"
        + "\n\n미로니까 복잡하게 만들면 좋겠지?"
        + "\n친구들이 늦게 도착하도록 막다른 길도 많이 만들어줘!",

        "출발과 도착 버튼으르 통해"
        + "\n내가 출발할 곳과 도착할 곳을 정해줄 수 있어!"
        + "\n\n아래에 있는 버튼을 누르고 화면을 터치하면 끝!"
        + "\n\n출발과 도착은 하나씩만 사용해야겠지?",

        "미로가 완성되었으면 플레이 버튼을 누르고"
        + "\n플레이를 해서 미로가 잘 만들어졌나 확인해줘!"
        + "\n\n미로를 성공적으로 클리어하면 설계는 끝이야!"
        + "\n\n출발과 도착이 하나씩 있지 않으면"
        + "\n플레이가 안 되니까 주의해줘!",

        "자 이제 내가 만든 미로를 친구들에게 공유할 시간이야!"
        + "\n\n내가 만든 여러개의 미로 중 3개까지 공유가 가능하고"
        + "\n공유하는 방법에는 직접 공유와 검색기능이 있어!"
        + "\n\n직접 공유는 여기에서 링크를 복사해 친구에게 주면 돼!"
        + "\n\n검색할 때에는 '미로이름'이나 '닉네임'을 선택한 후"
        + "\n그에 맞는 검색어를 입력하고 체크버튼을 누르면 끝!"
        + "\n\n검색 결과가 나오지 않는다면 미로이름인지 닉네임인지,"
        + "\n알맞게 검색했는지 다시 한 번 확인해봐!",

        "자 이제 정말 미로를 즐길 시간이야!"
        + "\n여기에서 플레이 표지판을 눌러"
        + "\n현재 플레이 할 수 있는 미로들을 확인한 후"
        + "\n플레이할 미로를 누르고 플레이하면 돼!",

        "플레이할 때 측정된 시간은 플레이 표지판을 누르고"
        + "\n파일을 선택하면 확인할 수 있어!"
        + "\n\n이제 미로를 만들고 플레이해봐!"
        + "\n\n난 땅굴로 자러가야겠어.. 안녕~"
    };
}
