using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class TutorialScript
{
    public static readonly string[] scripts = 
    {
        "안녕! 나는 두돼지야 Miner에 온걸 환영해!"
        + "\n\n여기서는 미로를 직접 만들고 공유할 수 있어!"
        + "\n\n그럼 지금부터 어떻게 미로를 만들고"
        + "\n공유할 수 있을지 설명해줄게!",

        "먼저, '설계' 표지판을 누르면"
        + "\n미로를 만들 수 있는 페이지가 나와!"
        + "\n\n여기 '추가' 버튼을 눌러 미로를 만들면 돼!"
        + "\n\n이제 들어가서 어떻게 해야할 지 알려줄게!",

        "자, 여기서는 미로를 만들 수 있어!"
        + "\n\n아래에 있는 곡괭이를 누르고 잔디를 누르면"
        + "\n잔디(벽)을 흙(길)로 바꿀 수 있어!"
        + "\n\n이 상태로 한 번 더 누르면"
        + "\n다시 잔디로 돌아오는 것도 기억해둬!",

        "여기 있는 출발과 도착을 통해"
        + "\n내가 출발할 곳과 도착할 곳을 정해줄 수 있어!"
        + "\n\n사용법은 곡괭이(설계)와 동일하게"
        + "\n선택된 채로 누르면 설치하고 없앨 수 있어!"
        + "\n\n출발과 도착은 하나씩만 사용해야겠지?",

        "길을 다 만들었어? 그럼 이 버튼을 눌러봐!"
        + "\n미로를 만들어서 플레이 해볼 수 있어!"
        + "\n\n출발과 도착이 하나씩 있지 않으면"
        + "\n플레이가 안 되니까 주의해줘!"
        + "\n\n우측 상단에 설정버튼을 누르면"
        + "\n미로를 저장할 수 있어!",

        "미로를 성공적으로 만들었다면"
        + "\n공유하는 방법을 알려줄게!"
        + "\n\n여기서 맵의 오른쪽에 있는 아이콘을 누르면"
        + "\n미로를 공유 및 삭제할 수 있어!"
        + "\n\n공유 버튼을 눌러서 들어가줘!",

        "여기서 왼쪽 버튼(Public)을 누르고 완료하면"
        + "\n모든 사람들이 이 미로를 플레이할 수 있어!"
        + "\n\n그리고 오른쪽 버튼(Private)을 누르면"
        + "\n미로의 비밀번호를 설정할 수 있어!"
        + "\n\n비밀번호를 설정할 때에는"
        + "\n꼭 4자리 숫자로 설정해야해!",

        "미로를 만들고 공유했으니"
        + "\n다른 사람들이 만든 미로도 볼까?"
        + "\n\n나와서 '플레이' 표지판을 누르면"
        + "\n미로를 플레이 할 수 있는 페이지가 나와!"
        + "\n\n여기서 인기순이나 최신순을 선택하면"
        + "\n이에 맞는 미로가 순서대로 나와!",

        "미로를 검색할 때에는"
        + "\n'미로이름'이나 '닉네임'을 선택한 후"
        + "\n옆 검색창에 검색하고 체크버튼을 눌러줘!"
        + "\n\n검색결과가 나오지 않는다면"
        + "\n미로인지 닉네임인지,"
        + "\n알맞게 검색했는지 다시 한 번 확인해봐!",

        "플레이 하고싶은 미로를 찾았다면"
        + "\n미로에 눌러서 들어가볼게!",

        "이렇게 미로를 누르면"
        + "\n다른 사람들이 플레이 한 기록이 나와!"
        + "\n\n그리고 나도 플레이를 하고싶다면"
        + "\n아래에 플레이 버튼을 눌러서 플레이해줘!",

        "마지막으로 플레이를 하게되면 보이는"
        + "\n빵에 대해 설명해줄게!"
        + "\n\n이 빵으로 내가 지나온 길을 표시할 수 있어!"
        + "\n\n빵 아래에 숫자는 남은 빵 개수이고"
        + "\n위에 있는 + 버튼을 누르면"
        + "\n광고를 보고 충전할 수 있어!",

        "아 참 미로를 플레이 하던 도중 나오면"
        + "\n플레이 하던건 저장이 안 되니까 참고해!"
        + "\n\n설명을 끝났으니 미로를 만들고 플레이해봐"
        + "\n\n흐아암.. 말을 너무 많이 했더니 피곤하네"
        + "\n난 이제 땅굴로 자러가야겠어... 안녕~",
    };
}
